
print('Доброго дня, ви потрапили на гру вгадай відповідь.')
tematika = input('Оберіть тематику з поданих: Математика,географія, Фізика.')

if tematika == 'математика':
    score = 0
    answ = input("1. Скільки буде 5 + 3? ")
    if answ == '8':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("2. Скільки буде 12 - 4? ")
    if answ == '8':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("3. Скільки буде 6 * 7? ")
    if answ == '42':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("4. Скільки буде 81 / 9? ")
    if answ == '9':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("5. Скільки буде 2 ** 3? ")
    if answ == '8':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("6. Скільки буде 10 % 3? ")
    if answ == '1':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")

    answ = input("7. Скільки буде (4 + 6) * 2? ")
    if answ == '20':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")

    answ = input("8. Скільки буде 100 - 45? ")
    if answ == '55':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")

    answ = input("9. Скільки буде 9 * 9? ")
    if answ == '81':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")

    answ = input("10. Скільки буде 144 / 12? ")
    if answ == '12':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")

    answ = input("11. Скільки буде 7 + 6 - 3? ")
    if answ == '10':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")

    answ = input("12. Скільки буде 3 ** 2? ")
    if answ == '9':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")

    answ = input("13. Скільки буде 20 // 3? (ціла частина) ")
    if answ == '6':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")

    answ = input("14. Скільки буде 0 * 1000? ")
    if answ == '0':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("15. Скільки буде (3 + 5) * (2 + 2)? ")
    if answ == '32':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    print(f"\nВаш фінальний рахунок: {score} з 15")




elif tematika == 'географія':
    score = 0

    answ = input("1. Яка столиця Франції? ")
    if answ == 'париж':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("2. Найбільша країна за площею? ")
    if answ == 'росія':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("3. Яке море біля півдня України? ")
    if answ == 'чорне':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")

    answ = input("4. На якому континенті пустеля Сахара? ")
    if answ == 'африка':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")

    answ = input("5. Столиця Японії? ")
    if answ == 'токіо':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("6. Найдовша річка у світі? ")
    if answ == 'ніл':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("7. Найвища гора світу? ")
    if answ == 'еверест':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("8. Столиця Канади? ")
    if answ == 'оттава':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("9. Найбільше озеро за площею? ")
    if answ == 'каспійське':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("10. Найбільш населена країна? ")
    if answ == 'китай':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("11. Столиця Австралії? ")
    if answ == 'канберра':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("12. Найбільший океан? ")
    if answ == 'тихий':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("13. Країна на Апеннінському півострові? ")
    if answ == 'італія':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("14. Столиця Бразилії? ")
    if answ == 'бразиліа':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("15. У якій країні Великий каньйон? ")
    if answ == 'сша':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")

    print(f"\nВаш фінальний рахунок: {score} з 15")




elif tematika == 'фізика':

    score = 0
    answ = input("1. Яка фізична величина вимірюється в метрах? ")
    if answ == 'Довжина':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("2. Яка одиниця вимірювання сили? ")
    if answ == 'Ньютон':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("3. Яка швидкість поширення світла у вакуумі (у м/с)? ")
    if answ == '300000000':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("4. Який прилад використовують для вимірювання сили струму? ")
    if answ == 'Амперметр':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("5. Яка одиниця вимірювання електричної напруги? ")
    if answ == 'Вольт':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("6. Як називається явище відбиття звуку? ")
    if answ == 'Луна':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("7. Що вимірює термометр? ")
    if answ == 'Температуру':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("8. Яка одиниця вимірювання маси в СІ? ")
    if answ == 'Кілограм':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("9. Яка величина позначається літерою «g» і ≈ 9,8 м/с²? ")
    if answ == 'Прискорення вільного падіння':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("10. Який агрегатний стан має вода при 0°C? ")
    if answ == 'Твердий':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("11. Який закон описує залежність між силою, масою та прискоренням? (напишіть: Другий закон Ньютона) ")
    if answ == 'Другий закон Ньютона':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("12. Яка одиниця вимірювання енергії? ")
    if answ == 'Джоуль':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("13. Як називається сила, що притягує тіла до Землі? ")
    if answ == 'Гравітація':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("14. Що є джерелом електричної енергії в електричному колі? ")
    if answ == 'Джерело струму':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")
    answ = input("15. Яка частина електричного кола перетворює енергію на світло або тепло? ")
    if answ == 'Споживач':
        print("Молодець +1 очко")
        score += 1
    else:
        print("Неправильно +0 очок")

    print(f"\nВаш фінальний рахунок: {score} з 15")
