from xml.sax.saxutils import prepare_input_source

print('Доброго дня, ви потрапили на гру вгадай відповідь.')
print('Вам подрібно обрати одну із трьох відповідей')
answer1 = input("Яка столиця України? Київ, Лондон чи Париж ")

score = 0

if answer1 == 'Київ':
    print('Молодець, правильно +1 очко ')
    score += 1
else:
    print("неправильно +0 балів")
answ2 = input('Яка найбільша планета Сонячної системи? Юпітер, Земля чи Марс')
if answ2 == 'Юпітер':
    print('Молодець +1 очко')
    score += 1
else:
    print('Знову не правильно +0 очок')
answ3 = input('- Яка столиця Канади? давай тепер без підсказок')
if answ3 == "Оттава":
    print('Молодчина, +1 бал')
    score += 1
else:
    print('Невезуха, +0 балів')
print(f'Гра завершена. Ваш результат: {score} балів.')